; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v9 ?v7)
             (pred_8 ?v5 ?v4)
             (pred_9 ?v9 ?v4)
             (pred_4 ?v1 ?v9 )
	     (pred_10 ?v9)
             (pred_5 ?v10)
             (pred_7 ?v5)
             (pred_1 ?v4)
             (pred_12 ?v9)
             (pred_2 ?v5)
             (pred_3 ?v9)
             (pred_11 ))



(:action op_5
:parameters (?v11 ?v8 ?v2 ?v3)
:precondition (and (pred_5 ?v11) (pred_5 ?v8) (pred_7 ?v2) (pred_1 ?v3)
          (pred_6 ?v11 ?v8) (pred_8 ?v2 ?v3)
                   (pred_9 ?v8 ?v3) (pred_10 ?v11) 
                   (pred_12 ?v8) (pred_2 ?v2))
:effect (and  (pred_3 ?v8) (not (pred_12 ?v8))))


(:action op_4
:parameters (?v11 ?v6)
:precondition (and (pred_5 ?v11) (pred_5 ?v6)
               (pred_10 ?v11) (pred_6 ?v11 ?v6) (pred_3 ?v6))
:effect (and (pred_10 ?v6) (not (pred_10 ?v11))))

(:action op_2
:parameters (?v11 ?v2)
:precondition (and (pred_5 ?v11) (pred_7 ?v2) 
                  (pred_10 ?v11) (pred_4 ?v2 ?v11) (pred_11 ))
:effect (and (pred_2 ?v2)
   (not (pred_4 ?v2 ?v11)) (not (pred_11 ))))


(:action op_1
:parameters (?v11 ?v13 ?v12)
:precondition (and (pred_5 ?v11) (pred_7 ?v13) (pred_7 ?v12)
                  (pred_10 ?v11) (pred_2 ?v12) (pred_4 ?v13 ?v11))
:effect (and (pred_2 ?v13) (pred_4 ?v12 ?v11)
        (not (pred_2 ?v12)) (not (pred_4 ?v13 ?v11))))

(:action op_3
:parameters (?v11 ?v2)
:precondition (and (pred_5 ?v11) (pred_7 ?v2) 
                  (pred_10 ?v11) (pred_2 ?v2))
:effect (and (pred_11 ) (pred_4 ?v2 ?v11) (not (pred_2 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_06 obj_13 obj_25 obj_23 obj_07 obj_24 obj_10 obj_14 obj_05 obj_12 obj_28 obj_09 obj_16 obj_20 obj_04 obj_17 obj_03 obj_08 obj_22 obj_01 obj_27 obj_29 obj_02 obj_26
    obj_19 obj_21 obj_18
    obj_30 obj_15 obj_31
    )

    (:init
       (pred_11)

       (pred_5 obj_11)
       (pred_5 obj_06)
       (pred_5 obj_13)
       (pred_5 obj_25)
       (pred_5 obj_23)
       (pred_5 obj_07)
       (pred_5 obj_24)
       (pred_5 obj_10)
       (pred_5 obj_14)
       (pred_5 obj_05)
       (pred_5 obj_12)
       (pred_5 obj_28)
       (pred_5 obj_09)
       (pred_5 obj_16)
       (pred_5 obj_20)
       (pred_5 obj_04)
       (pred_5 obj_17)
       (pred_5 obj_03)
       (pred_5 obj_08)
       (pred_5 obj_22)
       (pred_5 obj_01)
       (pred_5 obj_27)
       (pred_5 obj_29)
       (pred_5 obj_02)
       (pred_5 obj_26)
       (pred_1 obj_19)
       (pred_1 obj_21)
       (pred_1 obj_18)
       (pred_7 obj_30)
       (pred_7 obj_15)
       (pred_7 obj_31)

       (pred_6 obj_11 obj_07)
       (pred_6 obj_11 obj_06)
       (pred_6 obj_06 obj_24)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_06 obj_11)
       (pred_6 obj_13 obj_10)
       (pred_6 obj_13 obj_25)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_25 obj_14)
       (pred_6 obj_25 obj_23)
       (pred_6 obj_25 obj_13)
       (pred_6 obj_23 obj_05)
       (pred_6 obj_23 obj_25)
       (pred_6 obj_07 obj_12)
       (pred_6 obj_07 obj_24)
       (pred_6 obj_07 obj_11)
       (pred_6 obj_24 obj_28)
       (pred_6 obj_24 obj_10)
       (pred_6 obj_24 obj_06)
       (pred_6 obj_24 obj_07)
       (pred_6 obj_10 obj_09)
       (pred_6 obj_10 obj_14)
       (pred_6 obj_10 obj_13)
       (pred_6 obj_10 obj_24)
       (pred_6 obj_14 obj_16)
       (pred_6 obj_14 obj_05)
       (pred_6 obj_14 obj_25)
       (pred_6 obj_14 obj_10)
       (pred_6 obj_05 obj_20)
       (pred_6 obj_05 obj_23)
       (pred_6 obj_05 obj_14)
       (pred_6 obj_12 obj_04)
       (pred_6 obj_12 obj_28)
       (pred_6 obj_12 obj_07)
       (pred_6 obj_28 obj_17)
       (pred_6 obj_28 obj_09)
       (pred_6 obj_28 obj_24)
       (pred_6 obj_28 obj_12)
       (pred_6 obj_09 obj_03)
       (pred_6 obj_09 obj_16)
       (pred_6 obj_09 obj_10)
       (pred_6 obj_09 obj_28)
       (pred_6 obj_16 obj_08)
       (pred_6 obj_16 obj_20)
       (pred_6 obj_16 obj_14)
       (pred_6 obj_16 obj_09)
       (pred_6 obj_20 obj_22)
       (pred_6 obj_20 obj_05)
       (pred_6 obj_20 obj_16)
       (pred_6 obj_04 obj_01)
       (pred_6 obj_04 obj_17)
       (pred_6 obj_04 obj_12)
       (pred_6 obj_17 obj_27)
       (pred_6 obj_17 obj_03)
       (pred_6 obj_17 obj_28)
       (pred_6 obj_17 obj_04)
       (pred_6 obj_03 obj_29)
       (pred_6 obj_03 obj_08)
       (pred_6 obj_03 obj_09)
       (pred_6 obj_03 obj_17)
       (pred_6 obj_08 obj_02)
       (pred_6 obj_08 obj_22)
       (pred_6 obj_08 obj_16)
       (pred_6 obj_08 obj_03)
       (pred_6 obj_22 obj_26)
       (pred_6 obj_22 obj_20)
       (pred_6 obj_22 obj_08)
       (pred_6 obj_01 obj_27)
       (pred_6 obj_01 obj_04)
       (pred_6 obj_27 obj_29)
       (pred_6 obj_27 obj_17)
       (pred_6 obj_27 obj_01)
       (pred_6 obj_29 obj_02)
       (pred_6 obj_29 obj_03)
       (pred_6 obj_29 obj_27)
       (pred_6 obj_02 obj_26)
       (pred_6 obj_02 obj_08)
       (pred_6 obj_02 obj_29)
       (pred_6 obj_26 obj_22)
       (pred_6 obj_26 obj_02)
       (pred_12 obj_17)
       (pred_12 obj_06)
       (pred_12 obj_09)
       (pred_9  obj_17 obj_19)
       (pred_9  obj_06 obj_21)
       (pred_9  obj_09 obj_18)
       (pred_3 obj_11)
       (pred_3 obj_13)
       (pred_3 obj_25)
       (pred_3 obj_23)
       (pred_3 obj_07)
       (pred_3 obj_24)
       (pred_3 obj_10)
       (pred_3 obj_14)
       (pred_3 obj_05)
       (pred_3 obj_12)
       (pred_3 obj_28)
       (pred_3 obj_16)
       (pred_3 obj_20)
       (pred_3 obj_04)
       (pred_3 obj_03)
       (pred_3 obj_08)
       (pred_3 obj_22)
       (pred_3 obj_01)
       (pred_3 obj_27)
       (pred_3 obj_29)
       (pred_3 obj_02)
       (pred_3 obj_26)

       (pred_8  obj_30 obj_19)
       (pred_8  obj_15 obj_21)
       (pred_8  obj_31 obj_18)
       (pred_4 obj_30 obj_20)
       (pred_4 obj_15 obj_27)
       (pred_4 obj_31 obj_03)
       (pred_10 obj_27)
    )

    (:goal (and
       (pred_4 obj_15 obj_24)
    ))
(:constraints
  (always (not (pred_10 obj_04)))
)
)

; plan
1. (op_2 obj_27 obj_15)
   deleted: (pred_4 obj_15 obj_27) (pred_11)
   added: (pred_2 obj_15)
   goals met: 0 of 1
2. (op_4 obj_27 obj_29)
   deleted: (pred_10 obj_27)
   added: (pred_10 obj_29)
   goals met: 0 of 1
3. (op_4 obj_29 obj_03)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_03)
   goals met: 0 of 1
4. (op_4 obj_03 obj_08)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_08)
   goals met: 0 of 1
5. (op_4 obj_08 obj_16)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_16)
   goals met: 0 of 1
6. (op_4 obj_16 obj_14)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_14)
   goals met: 0 of 1
7. (op_4 obj_14 obj_10)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_10)
   goals met: 0 of 1
8. (op_4 obj_10 obj_24)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_24)
   goals met: 0 of 1
9. (op_3 obj_24 obj_15)
   deleted: (pred_2 obj_15)
   added: (pred_11) (pred_4 obj_15 obj_24)
   goals met: 1 of 1
